In [5]:
import pandas as pd
df= pd.read_excel("C:\\Users\\www\\Documents\\data science\\Machine Learning\\py-8c300d9c74d4dcc901538eb47dec9aa1d1cf26c7\\ML\\9_decision_tree\\\Exercise\\titanic.xlsx","titanic")

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df= df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis="columns")

In [8]:
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [9]:
df.isnull

<bound method DataFrame.isnull of      Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]>

In [10]:
df= df.dropna()

In [11]:
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
885         0       3  female  39.0  29.1250
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[714 rows x 5 columns]

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
le_Sex= LabelEncoder()
le_Fare= LabelEncoder()

In [14]:
inputs= df.drop(["Survived"],axis="columns")
predict=(df["Survived"])

In [15]:
inputs["le_Sex"]= le_Sex.fit_transform(inputs["Sex"])
inputs["le_Fare"]= le_Fare.fit_transform(inputs["Fare"])

In [16]:
inputs= inputs.drop(["Sex","Fare"],axis="columns")
inputs

     Pclass   Age  le_Sex  le_Fare
0         3  22.0       1       16
1         1  38.0       0      180
2         3  26.0       0       32
3         1  35.0       0      163
4         3  35.0       1       34
..      ...   ...     ...      ...
885       3  39.0       0      128
886       2  27.0       1       72
887       1  19.0       0      130
889       1  26.0       1      130
890       3  32.0       1       23

[714 rows x 4 columns]

In [17]:
from sklearn import tree
model= tree.DecisionTreeClassifier()

In [18]:
model.fit(inputs, predict)

DecisionTreeClassifier()

In [19]:
model.score(inputs, predict)

0.9845938375350141

In [20]:
model.predict([[3,19,0,130]])

array([0], dtype=int64)

In [21]:
inputs.le_Fare.describe()

count    714.000000
mean      94.819328
std       61.701468
min        0.000000
25%       34.000000
50%       88.000000
75%      139.750000
max      219.000000
Name: le_Fare, dtype: float64

In [22]:
import pickle

In [23]:
with open("model_pickle","wb") as f:
    pickle.dump(model,f)

In [24]:
with open("model_pickle", "rb") as f:
    mp = pickle.load(f)

In [25]:
mp.predict([[3,19,0,130]])

array([0], dtype=int64)

In [26]:
import pickle
with open("titanicmodel.pkl","wb") as f:
    pickle.dump(model,f)